# InvalidWorksetId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
WorksetId..::..InvalidWorksetId Property
WorksetId Class See Also
---
Get the invalid WorksetId whose IntegerValue is -1.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static WorksetId InvalidWorksetId { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidWorksetId As WorksetId
	Get
```

Visual C++
---
```text
public:
static property WorksetId^ InvalidWorksetId {
	WorksetId^ get ();
}
```

# See Also
WorksetId Class
Autodesk.Revit.DB Namespace